In [1]:
import pandas as pd

In [2]:
pd.read_csv("course_offerings.csv")

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [3]:
pd.read_csv("course_offerings.csv", header = None)

           0                            1             2
0  course_id                  course_name    instructor
1        101              Intro to Python  Chris Bruehl
2        102                 Intro to SQL   John Pauler
3        201    Exploratory Data Analysis    Alice Zhao
4        301                   Algorithms  Chris Bruehl
5        331  Natural Language Processing    Alice Zhao

In [4]:
pd.read_csv("course_offerings.csv", sep = '|')

             course_id,course_name,instructor
0            101,Intro to Python,Chris Bruehl
1                102,Intro to SQL,John Pauler
2    201,Exploratory Data Analysis,Alice Zhao
3                 301,Algorithms,Chris Bruehl
4  331,Natural Language Processing,Alice Zhao

In [7]:
pd.read_excel("Course Offerings.xlsx")

     Instructor                    Title
0  Chris Bruehl   Lead Python Instructor
1   John Pauler     Chief Growth Officer
2    Alice Zhao  Data Science Instructor

In [8]:
df = pd.read_csv("course_offerings.csv")
df

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [9]:
df.head(3)

   course_id                course_name    instructor
0        101            Intro to Python  Chris Bruehl
1        102               Intro to SQL   John Pauler
2        201  Exploratory Data Analysis    Alice Zhao

In [10]:
df.head()

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [11]:
df.shape

(5, 3)

In [12]:
df.describe()

        course_id
count    5.000000
mean   207.200000
std    107.829495
min    101.000000
25%    102.000000
50%    201.000000
75%    301.000000
max    331.000000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   course_id    5 non-null      int64
 1   course_name  5 non-null      object
 2   instructor   5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes